{
  "name": "Recast Architecture",
  "icon": "emcworld:prefix_core",
  "category": "block",
  "sortnum": 10,
  "pages": [
    {
      "type": "text",
      "text": "This architecture can be formed under a single block, and multi-block structures have other uses, please see below. $(br2)This is achieved by injecting the weight of reinforced scrolls into the recasting scroll and using the recasting scroll to refresh the equipment's prefix."
    },
    {
      "type": "text",
      "text": "There are two modes for this architecture: $(br2)Injection Mode: Place any type of reinforced scroll on the left side and the recasting scroll on the right side to inject the weight of the reinforced scroll into the recasting scroll. $(br2)If the reinforced scroll has a weapon loss probability, only the non-loss part is injected. $(br2)For example, the Togepi Scroll actually injects 2500 * (1-30%) = 1750 weight. $(br2)It should be noted that this operation is $(c)irreversible$()."
    },
    {
      "type": "text",
      "text": "When recasting, the weight will be multiplied by the current difficulty coefficient of the modpack. $(br2)After injecting weight into the recasting scroll, the player can hover over it to see the percentage of prefixes it can recast. $(br2)The higher the weight, the higher the probability of upgrading to higher prefixes, but each weight refresh is random, so a higher weight $(c)does not necessarily$() mean a higher probability of high prefixes. $(br2)The other mode is the recasting mode, which requires placing the recasting scroll on the left and the equipment to be refreshed with prefixes on the right."
    },
    {
      "type": "text",
      "text": "Press the recast button to refresh the equipment's prefix, and the probability will be determined by the probability of the recasting scroll. $(br2)Each recasting scroll can only be used once. $(br2)Recasting scrolls can be exchanged for at the highest level of EMCWorld's Energy Condenser. $(br2)Some Energy Condenser and weapons will have a minimum prefix, such as epic prefixes for Energy Condenser +22 and above. $(br2)Multi-block structures can increase additional injection in injection mode, and multi-block structures are shown on the next page."
    },
    {
      "type": "text",
      "text": "Multi-block structures: $(br2)I haven't figured it out yet."
    }
  ]
}