{
  "name": "Weapon Upgrade Core",
  "icon": "emcworld:weapon_upgrade_core",
  "category": "block",
  "sortnum": 4,
  "pages": [
    {
      "type": "text",
      "text": "This architecture can be used with a single block and does not require a multi-block structure. $(br2) All weapons, tools, and armor can be upgraded, and their level will be displayed as +x next to their name. $(br2) Each time they are upgraded, their attributes such as attack power, area attack, healing efficiency, and maximum health will change. The properties that different types of items will change are not the same."
    },
    {
      "type": "text",
      "text": "$(br2)As the item is upgraded, its additional attributes will increase linearly, but the additional attributes of the $(6)Energy Sacred Artifact$() will increase exponentially. $(br2)After opening the GUI, place the equipment that needs to be upgraded in the center and put $(6)Energy Sacred Artifacts$() or $(6)Weapon Upgrade Scrolls$() in the four slots around it. The success rate of the current upgrade will be displayed on the right."
    },
    {
      "type": "text",
      "text": "You can put $(5)Lucky Crystals$() in the lower right slot to increase the success rate of the upgrade. $(br2)When you are ready, close the GUI page, keep your hands empty, and hold down the sneak key while right-clicking the Weapon Upgrade Core to upgrade the equipment. $(br2)If the upgrade is successful, the equipment's level will increase by 1. If the upgrade fails, there will be no change. $(br2)It is worth noting that when the equipment's upgrade level is greater than one-third of its maximum level, the upgrade will $(4)degrade by one level$() after a failed attempt."
    },
    {
      "type": "text",
      "text": "Whether the upgrade is successful or not, the surrounding materials and lucky gems will be consumed. $(br2)When the upgrade fails (whether or not a multi-block is built), a certain amount of $(5)Lucky Gems$() will be produced above it, and the number of gems produced is related to the success rate and upgrade level. $(br2)Eight Lucky Gems can be combined to create a higher-level Lucky Gem."
    }
  ]
}